0.57.2119-1/Catalogs/ККСНГ_Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодУчастникаЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>47</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСК</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьУКД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНастройкиОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникБанкаEmail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ1</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ2</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнформационныеПоляФХЖ3</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формула</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеУсловий</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоговорыУВХД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор1С</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЗначенияСвойствОбъектов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорУВХД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ККСНГ_ЭлектронныеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_Контрагенты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем НастройкаПоУмолчанию;
	Перем СписокВариантовОтправки, ВариантОтправкиМЧД;
	Перем ДоступныйВариант, ВариантыНастроекОбмена, НекийФормат;
	Перем ТаблицаФорматов, ВариантНастройкиОтбора, Отбор;
	Перем ТекПрофильЭДО, МодульККСНГ_ПМ_РаботаСМетаданными;
	
	НастройкаПоУмолчанию = "Использовать настройки организации";
	ЭтотОбъект.ВариантНастроекОрганизации = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьДоступныйФорматЭлектронногоДокумента(Объект.Владелец.ВариантНастройкиОбмена);
	
	// Варианты отправки МЧД 
	СписокВариантовОтправки = Элементы.ВариантОтправкиМЧД.СписокВыбора;
	ВариантОтправкиМЧД = ККСНГ_МашиночитаемыеДоверенности.ДоступныеВариантыОтправкиДоверенности();
	
	СписокВариантовОтправки.Очистить();
	
	СписокВариантовОтправки.Добавить("", НастройкаПоУмолчанию);
	Для каждого ДоступныйВариант Из ВариантОтправкиМЧД Цикл
		СписокВариантовОтправки.Добавить(ДоступныйВариант.Значение, ДоступныйВариант.Представление);
	КонецЦикла;
	
	Если СписокВариантовОтправки.НайтиПоЗначению(Объект.ВариантОтправкиМЧД) = Неопределено И СписокВариантовОтправки.Количество() > 0 Тогда
		Объект.ВариантОтправкиМЧД = СписокВариантовОтправки[0].Значение;
	КонецЕсли;
	
	// Варианты настроек обмена ФНС
	ВариантыНастроекОбмена = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьВариантыФорматовЭлектронныхДокументов();
	
	Элементы.СписокВариантовНастроекОбмена.СписокВыбора.Вставить(0, НастройкаПоУмолчанию);
	Для каждого НекийФормат Из ВариантыНастроекОбмена Цикл
		Элементы.СписокВариантовНастроекОбмена.СписокВыбора.Добавить(НекийФормат);
	КонецЦикла;
	Если Объект.ВариантНастройкиОбмена <> НастройкаПоУмолчанию Тогда
		Объект.ВариантНастройкиОбмена = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьДоступныйФорматЭлектронногоДокумента(Объект.ВариантНастройкиОбмена);
	КонецЕсли;
	
	// Таблица форматов ФНС
	ТаблицаФорматов = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьФорматыЭлектронныхДокументов();
	
	ИсходящиеДокументы.Загрузить(ТаблицаФорматов);
	
	ВариантНастройкиОтбора = ?(Объект.ВариантНастройкиОбмена = НастройкаПоУмолчанию, ВариантНастроекОрганизации, Объект.ВариантНастройкиОбмена);
	ВариантНастройкиОтбора = ?(ЗначениеЗаполнено(ВариантНастройкиОтбора), ВариантНастройкиОтбора, "_");
	Отбор = Новый ФиксированнаяСтруктура("НаименованиеВарианта", ВариантНастройкиОтбора);
	Элементы.ИсходящиеДокументы.ОтборСтрок = Отбор;
	
	ТекПрофильЭДО = Объект.Владелец;
	
	// Устанавливаем ограничение типов для реквизитов
	МодульККСНГ_ПМ_РаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	Если Не МодульККСНГ_ПМ_РаботаСМетаданными = Неопределено Тогда
		
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.Договор, "ДоговорыСоглашения");
		Элементы.Договор.Видимость = Элементы.Договор.ОграничениеТипа.Типы().Количество(); 
		
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.ДоговорыУВХДПредставлениеДоговор1С, "ДоговорыСоглашения");
		
		МодульККСНГ_ПМ_РаботаСМетаданными.УстановитьОграничениеТипа(Элементы.Склад, "Склады");
		Элементы.Склад.Видимость = Элементы.Склад.ОграничениеТипа.Типы().Количество();
		
	КонецЕсли;
	
	Если Не Отказ И ЗначениеЗаполнено(ТекПрофильЭДО) И Не ККСНГ_ОбщегоНазначенияВызовСервера.ПрофильЭДОДоступенПользователю(ТекПрофильЭДО) Тогда
		Отказ = Истина;
		ККСНГ_ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У пользователя недостаточно прав для совершения операции.");
	Иначе
		ККСНГ_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораПрофилейЭДО(ТекПрофильЭДО, Элементы.Владелец, Истина);
	КонецЕсли;
	
	ИнформационныеПоляФХЖ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка);
	
	ЗагрузитьПредставленияДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ТекущийВариантНастройкиОбмена) Тогда
		ТекущийВариантНастройкиОбмена = Объект.ВариантНастройкиОбмена;
	КонецЕсли;
	
	ОбновитьОтображениеЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Склад) Тогда
		Попытка
			ЭтотОбъект.Склад = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(ТекущийОбъект, "Склад");
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ТекущийОбъект.Договор) Тогда
		Попытка
			ЭтотОбъект.Договор = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(ТекущийОбъект, "Договор");
		Исключение
			ОписаниеОшибки = ОписаниеОшибки();
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Склад", ЭтотОбъект.Склад);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Договор", ЭтотОбъект.Договор);
	
	ЗагрузитьХранилищеУсловийВОбъект(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗагрузитьХранилищеУсловийНаФорму(ТекущийОбъект);
	
	ЗагрузитьПредставленияДоговоров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если ТекущийВариантНастройкиОбмена <> Объект.ВариантНастройкиОбмена Тогда
		ПараметрыСобытия = Новый Структура;
		ПараметрыСобытия.Вставить("ПрофильЭДООрганизации", Объект.Владелец);
		ПараметрыСобытия.Вставить("КодУчастникаЭДООрганизации", КодЭДОВладельца(Объект.Владелец));
		ПараметрыСобытия.Вставить("КодУчастникаЭДОКонтрагента", Объект.КодУчастникаЭДО);
		ПараметрыСобытия.Вставить("НовыйВариантНастройкиОбмена", Объект.ВариантНастройкиОбмена);
		Оповестить("ОбновитьКОтправке", ПараметрыСобытия, ЭтотОбъект); 
		ТекущийВариантНастройкиОбмена = Объект.ВариантНастройкиОбмена;
	КонецЕсли;
	
	ОбновитьОтображениеЭлементов();
	
	Оповестить("ЗаписьКонтрагентаЭДО", Объект.Ссылка, Объект.Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантНастройкиОбменаПриИзменении(Элемент)
		
	ВариантНастройкиОтбора = ?(Объект.ВариантНастройкиОбмена = "Использовать настройки организации", ВариантНастроекОрганизации, Объект.ВариантНастройкиОбмена);
	ВариантНастройкиОтбора = ?(ЗначениеЗаполнено(ВариантНастройкиОтбора), ВариантНастройкиОтбора, "_");
	Отбор = Новый ФиксированнаяСтруктура("НаименованиеВарианта", ВариантНастройкиОтбора);
	Элементы.ИсходящиеДокументы.ОтборСтрок = Отбор;	
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ДоговорНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОбщийМодульРаботаСМетаданнымиКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданнымиКлиент");
	ВидыДоговоров = ОбщийМодульРаботаСМетаданнымиКлиент.ВидыДоговоровЗакупки();
	
	ДоговорыКонтрагентовВыбрать(ОписаниеОповещенияЗавершения, Элементы.ДоговорыУВХДПредставлениеДоговор1С, Договор, , ВидыДоговоров);
		
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбораЗавершение(Результат, ДопПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЭтотОбъект.Договор = Результат;	
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОрганизацияИзПрофиля(ПрофильЭДООрганизации)
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПрофильЭДООрганизации, "Организация", Истина);
КонецФункции

&НаКлиенте
Процедура ВладелецОчистка(Элемент, СтандартнаяОбработка)
	ЗадатьВопросПриИзмененииКонтрагента(Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ВладелецОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗадатьВопросПриИзмененииКонтрагента(Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКонтрагентаОрганизации()
	
	ОбновитьОтображениеЭлементов();
	
	Объект.Договор = Неопределено;
	
	Объект.ДоговорыУВХД.Очистить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодЭДОВладельца(ТекущийВладелец)
	
	Возврат ТекущийВладелец.КодУчастникаЭДО;
	
КонецФункции

&НаКлиенте
Процедура КодУчастникаЭДОПриИзменении(Элемент)
	
	ККСНГ_ОбщегоНазначенияКлиентСервер.ФорматироватьКодУчастникаЭДО(Объект.КодУчастникаЭДО);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОчистка(Элемент, СтандартнаяОбработка)
	ЗадатьВопросПриИзмененииКонтрагента(Модифицированность);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ЗадатьВопросПриИзмененииКонтрагента(Модифицированность);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнформационныеПоляФХЖ1

&НаКлиенте
Процедура ИнформационныеПоляФХЖ1ИдентификаторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ1.ТекущиеДанные;
	ТекущиеДанные.Использовать = ЗначениеЗаполнено(ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ1ДокументПриИзменении(Элемент)
	
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ1.ТекущиеДанные, Новый Структура("Условие, ХранилищеУсловийФорма, Формула"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ1ФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ1.ТекущиеДанные;
	ПараметрыОткрытияФормы = Новый Структура("ИмяТаблицыЗапроса", ТекущиеДанные.Документ);
	
	ОткрытьФормуКонструктораФормул(ТекущиеДанные, ПараметрыОткрытияФормы);
	
КонецПроцедуры	

&НаКлиенте
Процедура ИнформационныеПоляФХЖ1УсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ1.ТекущиеДанные;
	ПараметрыОткрытияФормы = Новый Структура("ИмяТаблицыЗапроса", ТекущиеДанные.Документ);

	ОткрытьФормуНастройкиУсловий(ТекущиеДанные, ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ1УсловиеОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ1.ТекущиеДанные, Новый Структура("ХранилищеУсловийФорма"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнформационныеПоляФХЖ2

&НаКлиенте
Процедура ИнформационныеПоляФХЖ2ДокументПриИзменении(Элемент)
	
	СтруктураОтбора = Новый Структура("Использовать, Условие, ХранилищеУсловийФорма, Формула, ТабличнаяЧасть", Ложь);
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ2.ТекущиеДанные, СтруктураОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ2ТабличнаяЧастьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ2.ТекущиеДанные;
	СписокТабличныхЧастей = ПолучитьТабличныеЧастиВыбораНаКлиенте(ТекущиеДанные.Документ);
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ОписаниеОповещенияВыбора = Новый ОписаниеОповещения("ОбработатьВыборТабличнойЧасти", ЭтотОбъект, ПараметрыОповещения);
	
	ПоказатьВыборИзСписка(ОписаниеОповещенияВыбора, СписокТабличныхЧастей);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ2ТабличнаяЧастьОчистка(Элемент, СтандартнаяОбработка)
	
	СтруктураОтбора = Новый Структура("Использовать, Формула, Условие, Условие, ХранилищеУсловийФорма", Ложь);
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ2.ТекущиеДанные, СтруктураОтбора);	
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ2ФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ2.ТекущиеДанные;
	ИмяТаблицыЗапроса = ТекущиеДанные.Документ + ?(ЗначениеЗаполнено(ТекущиеДанные.ТабличнаяЧасть), "." + ТекущиеДанные.ТабличнаяЧасть, "");
	ПараметрыОткрытияФормы = Новый Структура("ИмяТаблицыЗапроса", ИмяТаблицыЗапроса);
	
	ОткрытьФормуКонструктораФормул(ТекущиеДанные, ПараметрыОткрытияФормы);
	
КонецПроцедуры	

&НаКлиенте
Процедура ИнформационныеПоляФХЖ2УсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ2.ТекущиеДанные;
	ИмяТаблицыЗапроса = ТекущиеДанные.Документ + ?(ЗначениеЗаполнено(ТекущиеДанные.ТабличнаяЧасть), "." + ТекущиеДанные.ТабличнаяЧасть, "");
	ПараметрыОткрытияФормы = Новый Структура("ИмяТаблицыЗапроса", ИмяТаблицыЗапроса);
	
	ОткрытьФормуНастройкиУсловий(ТекущиеДанные, ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ2УсловиеОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ2.ТекущиеДанные, Новый Структура("ХранилищеУсловийФорма"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнформационныеПоляФХЖ3

&НаКлиенте
Процедура ИнформационныеПоляФХЖ3ИдентификаторПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ3.ТекущиеДанные;
	ТекущиеДанные.Использовать = ЗначениеЗаполнено(ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ3ДокументПриИзменении(Элемент)
	
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ3.ТекущиеДанные, Новый Структура("Условие, ХранилищеУсловийФорма, Формула"));
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ3ФормулаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ3.ТекущиеДанные;
	ПараметрыОткрытияФормы = Новый Структура("ИмяТаблицыЗапроса", ТекущиеДанные.Документ);
	
	ОткрытьФормуКонструктораФормул(ТекущиеДанные, ПараметрыОткрытияФормы);
	
КонецПроцедуры	

&НаКлиенте
Процедура ИнформационныеПоляФХЖ3УсловиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;		
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ИнформационныеПоляФХЖ3.ТекущиеДанные;
	ПараметрыОткрытияФормы = Новый Структура("ИмяТаблицыЗапроса", ТекущиеДанные.Документ);

	ОткрытьФормуНастройкиУсловий(ТекущиеДанные, ПараметрыОткрытияФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнформационныеПоляФХЖ3УсловиеОчистка(Элемент, СтандартнаяОбработка)
	
	ОчиститьУсловияОтбораВСтроке(Элементы.ИнформационныеПоляФХЖ3.ТекущиеДанные, Новый Структура("ХранилищеУсловийФорма"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоговорыУВХД

&НаКлиенте
Процедура ДоговорыУВХДДоговорУВХДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ВыборДоговораУВХДЗавершение", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ПрофильНастройкиЭДО", Объект.Владелец);
	ПараметрыФормы.Вставить("Контрагент", Объект.Ссылка);
	
	Отбор = Новый Структура();
	Отбор.Вставить("ИсключитьСопоставленныеДоговоры", Истина);
	Отбор.Вставить("ВыбранныеДоговоры", ПолучитьВыбранныеДоговорыУВХД(Элементы.ДоговорыУВХД.ТекущиеДанные.ДоговорУВХД));
	Отбор.Вставить("КонтрагентСсылка", Объект.Ссылка);
	ПараметрыФормы.Вставить("Отбор", Отбор);
	
	ОткрытьФорму("ОбщаяФорма.ККСНГ_ФормаВыбораДоговоровУВХД", ПараметрыФормы, , , , , ОписаниеОповещенияЗавершения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыУВХДПредставлениеДоговор1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещенияЗавершения = Новый ОписаниеОповещения("ВыборДоговора1СЗавершение", ЭтотОбъект);
	
	ТекущийДоговор1С = Элементы.ДоговорыУВХД.ТекущиеДанные.Договор1С;
	ИсключаемыеДоговоры1С = ПолучитьВыбранныеДоговоры1С(ТекущийДоговор1С);
	
	ОбщийМодульРаботаСМетаданнымиКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданнымиКлиент");
	ВидыДоговоров = ОбщийМодульРаботаСМетаданнымиКлиент.ВидыДоговоровПродажи();
	
	ДоговорыКонтрагентовВыбрать(ОписаниеОповещенияЗавершения, Элементы.ДоговорыУВХДПредставлениеДоговор1С, ТекущийДоговор1С, ИсключаемыеДоговоры1С, ВидыДоговоров);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборТипаДоговора1СПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Не Результат = Неопределено Тогда
		ОткрытьФормуВыбораДоговора1С(ДополнительныеПараметры.ОповещениеОЗавершении, Результат.Значение);	
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуВыбораДоговора1С(ОписаниеОповещенияЗавершения,
									   ТипЗначения, 
									   ТекущийДоговор1С = Неопределено, 
									   ИсключаемыеДоговоры1С = Неопределено,
									   ВидыДоговоров = Неопределено) Экспорт
	
	ОбщийМодульРаботаСМетаданнымиКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданнымиКлиент");
	ОбщийМодульРаботаСМетаданнымиКлиент.ДоговорыКонтрагентовВыбрать(ТипЗначения,
																	Объект.Контрагент, 
																	ОрганизацияИзПрофиля(Объект.Владелец), 
																	ВидыДоговоров, , 
																	ИсключаемыеДоговоры1С, 
																	ОписаниеОповещенияЗавершения);
			
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыКонтрагентовВыбрать(ОписаниеОповещенияВыбора, ЭлементФормы, ТекущийДоговор1С = Неопределено, ИсключаемыеДоговоры1С = Неопределено, ВидыДоговоров = Неопределено)
	
	Договор1СТипы = ЭлементФормы.ОграничениеТипа.Типы();
	Если Договор1СТипы.Количество() = 1 Тогда
		
		ОткрытьФормуВыбораДоговора1С(ОписаниеОповещенияВыбора, Договор1СТипы[0], ТекущийДоговор1С, ИсключаемыеДоговоры1С, ВидыДоговоров = Неопределено);	
		
	ИначеЕсли Договор1СТипы.Количество() > 1 Тогда
		
		ПараметрыОповещения = Новый Структура();
		ПараметрыОповещения.Вставить("ОповещениеОЗавершении", ОписаниеОповещенияВыбора);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыборТипаДоговора1СПродолжение", ЭтотОбъект, ПараметрыОповещения);
		
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(Договор1СТипы);
		СписокТипов.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите тип");		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыУВХДПредставлениеДоговор1СОчистка(Элемент, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ДоговорыУВХД.ТекущиеДанные;
	ТекущиеДанные.Договор1С = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнфоПоляФХЖ

&НаСервере
Процедура ИнформационныеПоляФХЖ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьСоответствияДокументовТабличнымЧастям();
	ЗаполнитьСписокВыбораДокументов();
	ЗагрузитьХранилищеУсловийНаФорму();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСоответствияДокументовТабличнымЧастям()
	
	ОбщийМодульРаботаСМетаданными = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьМодульПодсистемы("ККСНГ_ПМ_РаботаСМетаданными");
	ДокументыВыбора = ОбщийМодульРаботаСМетаданными.ПолучитьДокументыВыбора();
	Для каждого ДокументВыбора Из ДокументыВыбора Цикл
		
		ТабличныеЧастиВыбора = ОбщийМодульРаботаСМетаданными.ПолучитьТабличныеЧастиДокументаВыбора(ДокументВыбора.Значение);
		Для каждого ТабличнаяЧастьВыбора Из ТабличныеЧастиВыбора Цикл
			СтрокаСоответствия = СоответствияДокументовТабличнымЧастям.Добавить();
			СтрокаСоответствия.Документ = ДокументВыбора.Значение;
			СтрокаСоответствия.ДокументПредставление = ДокументВыбора.Представление;
			СтрокаСоответствия.ТабличнаяЧасть = ТабличнаяЧастьВыбора.Значение;
			СтрокаСоответствия.ТабличнаяЧастьПредставление = ТабличнаяЧастьВыбора.Представление;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораДокументов()
	
	ДокументыВыбора = ПолучитьДокументыВыбора();
	
	ЗагрузитьСписокЗначенийВСписокВыбора(Элементы.ИнформационныеПоляФХЖ1Документ.СписокВыбора, ДокументыВыбора);
	ЗагрузитьСписокЗначенийВСписокВыбора(Элементы.ИнформационныеПоляФХЖ2Документ.СписокВыбора, ДокументыВыбора);
	ЗагрузитьСписокЗначенийВСписокВыбора(Элементы.ИнформационныеПоляФХЖ3Документ.СписокВыбора, ДокументыВыбора);
	
	НастроитьУсловноеОформлениеСпискаВыбора(Элементы.ИнформационныеПоляФХЖ1Документ);
	НастроитьУсловноеОформлениеСпискаВыбора(Элементы.ИнформационныеПоляФХЖ2Документ);
	НастроитьУсловноеОформлениеСпискаВыбора(Элементы.ИнформационныеПоляФХЖ3Документ);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДокументыВыбора()
	
	ДокументыВыбора = Новый СписокЗначений;
	
	ДокументыОтбор = СоответствияДокументовТабличнымЧастям.Выгрузить(, "Документ, ДокументПредставление");
	ДокументыОтбор.Свернуть("Документ, ДокументПредставление");
	Для каждого СтрокаОтбора Из ДокументыОтбор Цикл
		ДокументыВыбора.Добавить(СтрокаОтбора.Документ, СтрокаОтбора.ДокументПредставление);	
	КонецЦикла;
	
	Возврат ДокументыВыбора;
	
КонецФункции

&НаКлиенте
Функция ПолучитьТабличныеЧастиВыбораНаКлиенте(ДокументВыбора)
	
	ТабличныеЧастиВыбора = Новый СписокЗначений;
	
	ТабличныеЧастиОтбор = СоответствияДокументовТабличнымЧастям.НайтиСтроки(Новый Структура("Документ", ДокументВыбора));
	Для каждого СтрокаОтбора Из ТабличныеЧастиОтбор Цикл
		ТабличныеЧастиВыбора.Добавить(СтрокаОтбора.ТабличнаяЧасть, СтрокаОтбора.ТабличнаяЧастьПредставление);	
	КонецЦикла;
	
	Возврат ТабличныеЧастиВыбора;	
	
КонецФункции

&НаСервере
Процедура ЗагрузитьСписокЗначенийВСписокВыбора(СписокВыбора, ДанныеЗагрузки)
	
	Для каждого ЭлементЗагрузки Из ДанныеЗагрузки Цикл
		СписокВыбора.Добавить(ЭлементЗагрузки.Значение, ЭлементЗагрузки.Представление);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьУсловноеОформлениеСпискаВыбора(ПолеФормы)
	
	Если ТипЗнч(ПолеФормы) = Тип("Строка") Тогда
		ПолеФормыВыбора = Элементы[ПолеФормы];
	Иначе
		ПолеФормыВыбора = ПолеФормы;
	КонецЕсли;
	
	Для каждого ЭлементВыбора Из ПолеФормыВыбора.СписокВыбора Цикл
		
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();

        ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", ЭлементВыбора.Представление);

        // Условие
        ЭлементУсловия  = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ПолеФормыВыбора.ПутьКДанным);
        ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
        ЭлементУсловия.ПравоеЗначение = ЭлементВыбора.Значение;

        // Поле
        ОформляемоеПоле = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
        ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеФормыВыбора.Имя);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьУсловияОтбораВСтроке(ТекущиеДанные, ДанныеОчистки)
	
	Для каждого ЭлементОчистки Из ДанныеОчистки Цикл
		ТекущиеДанные[ЭлементОчистки.Ключ] = ЭлементОчистки.Значение;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборУсловияОтбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	
	ТекущиеДанные.Условие = Результат.УсловиеПредставление;
	ТекущиеДанные.ХранилищеУсловийФорма = Результат.УсловиеЗначение;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборТабличнойЧасти(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		
		ОчиститьУсловияОтбораВСтроке(ДополнительныеПараметры.ТекущиеДанные, Новый Структура("Условие, ХранилищеУсловийФорма, Формула"));
		
		ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
		ТекущиеДанные.ТабличнаяЧасть = Результат.Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗаполнениеФормулы(Результат, ДополнительныеПараметры) Экспорт
	
	ТекущиеДанные = ДополнительныеПараметры.ТекущиеДанные;
	ТекущиеДанные.Использовать = ЗначениеЗаполнено(Результат);	
	
	Если НЕ Результат = Неопределено Тогда
		
		ТекущиеДанные.Формула = Результат;
		Модифицированность = Истина;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресСхемыКомпоновкиДанных(ТекстЗапроса)
	
	СхемаКомпоновки = ККСНГ_ОбщегоНазначения.ПолучитьСхемуКомпоновкиДанныхИзЗапроса(ТекстЗапроса);
	
	Возврат ПоместитьВоВременноеХранилище(СхемаКомпоновки, УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуНастройкиУсловий(ТекущиеДанные, ДополнительныеПараметры)
	
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ОписаниеОповещенияВыборУсловияОтбора = Новый ОписаниеОповещения("ОбработатьВыборУсловияОтбора", ЭтотОбъект, ПараметрыОповещения);
	
	ИмяТаблицыЗапроса = ДополнительныеПараметры.ИмяТаблицыЗапроса;
	ТекстЗапроса = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьТекстЗапросаПоТаблице(ИмяТаблицыЗапроса);
		
	АдресСхемыКомпоновки = ПолучитьАдресСхемыКомпоновкиДанных(ТекстЗапроса);
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("УсловиеОтбора", ТекущиеДанные.ХранилищеУсловийФорма);
	ПараметрыФормы.Вставить("АдресСхемыКомпоновки", АдресСхемыКомпоновки);
	
	ОткрытьФорму(
		"Справочник.ККСНГ_Контрагенты.Форма.ФормаНастроекУсловий", 
		ПараметрыФормы, 
		ЭтотОбъект, 
		, 
		, 
		, 
		ОписаниеОповещенияВыборУсловияОтбора, 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуКонструктораФормул(ТекущиеДанные, ДополнительныеПараметры)
	
	ИмяТаблицыЗапроса = ДополнительныеПараметры.ИмяТаблицыЗапроса;
	ТекстЗапроса = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьТекстЗапросаПоТаблице(ИмяТаблицыЗапроса);
	
	ПараметрыРедактированияШаблона = Новый Структура;
	ПараметрыРедактированияШаблона.Вставить("Формула", ТекущиеДанные.Формула);
	ПараметрыРедактированияШаблона.Вставить("АдресНабораОперандов", ПоместитьВоВременноеХранилище(ТекстЗапроса, УникальныйИдентификатор));
		
	ПараметрыОповещения = Новый Структура();
	ПараметрыОповещения.Вставить("ТекущиеДанные", ТекущиеДанные);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьЗаполнениеФормулы", ЭтотОбъект, ПараметрыОповещения);
	
	ОткрытьФорму(
		"ОбщаяФорма.ККСНГ_КонструкторФормул",
		ПараметрыРедактированияШаблона,
		ЭтотОбъект,
		,
		,
		,
		ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХранилищеУсловийНаФорму(ТекущийОбъект = Неопределено, ТабличныеЧастиФХЖ = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");		               	
	КонецЕсли;
	
	Если ТабличныеЧастиФХЖ = Неопределено Тогда
		ТабличныеЧастиФХЖ = ПолучитьМассивТабличныхЧастейФХЖ();		
	КонецЕсли;
	
	Для каждого ТабличнаяЧастьФХЖ Из ТабличныеЧастиФХЖ Цикл
		
		Для каждого ТекущиеДанные Из Объект[ТабличнаяЧастьФХЖ] Цикл
			
			ТекущиеДанные.ХранилищеУсловийФорма = ТекущийОбъект[ТабличнаяЧастьФХЖ][ТекущиеДанные.НомерСтроки - 1].ХранилищеУсловий;				
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьХранилищеУсловийВОбъект(ТекущийОбъект = Неопределено, ТабличныеЧастиФХЖ = Неопределено)
	
	Если ТекущийОбъект = Неопределено Тогда
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");		
	КонецЕсли;
	
	Если ТабличныеЧастиФХЖ = Неопределено Тогда
		ТабличныеЧастиФХЖ = ПолучитьМассивТабличныхЧастейФХЖ();		
	КонецЕсли;
	
	Для каждого ТабличнаяЧастьФХЖ Из ТабличныеЧастиФХЖ Цикл
		
		Для каждого ТекущиеДанные Из Объект[ТабличнаяЧастьФХЖ] Цикл
			
			ТекущийОбъект[ТабличнаяЧастьФХЖ][ТекущиеДанные.НомерСтроки - 1].ХранилищеУсловий = ТекущиеДанные.ХранилищеУсловийФорма;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивТабличныхЧастейФХЖ()
	
	ТабличныеЧастиФХЖ = Новый Массив;
	
	ТабличныеЧастиФХЖ.Добавить(Метаданные.Справочники.ККСНГ_Контрагенты.ТабличныеЧасти.ИнформационныеПоляФХЖ1.Имя);
	ТабличныеЧастиФХЖ.Добавить(Метаданные.Справочники.ККСНГ_Контрагенты.ТабличныеЧасти.ИнформационныеПоляФХЖ2.Имя);
	ТабличныеЧастиФХЖ.Добавить(Метаданные.Справочники.ККСНГ_Контрагенты.ТабличныеЧасти.ИнформационныеПоляФХЖ3.Имя);
	
	Возврат ТабличныеЧастиФХЖ;
	
КонецФункции

#КонецОбласти 

#Область НастройкиУВХД

&НаСервере
Процедура ЗагрузитьПредставленияДоговоров()
	
	Для каждого СтрокаДоговораУВХД Из Объект.ДоговорыУВХД Цикл
		Договор1С = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(СтрокаДоговораУВХД, "Договор1С");
		СтрокаДоговораУВХД.ПредставлениеДоговор1С = Договор1С;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДоговораУВХДЗавершение(ВыбранныйДоговор, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныйДоговор = Неопределено Тогда
		
		Модифицированность = Истина;
		
		ТекущиеДанные = Элементы.ДоговорыУВХД.ТекущиеДанные;
		ТекущиеДанные.ДоговорУВХД = ВыбранныйДоговор;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборДоговора1СЗавершение(ВыбранныйДоговор, ДополнительныеПараметры) Экспорт
	
	Если Не ВыбранныйДоговор = Неопределено Тогда
		
		Модифицированность = Истина;
		
		ТекущиеДанные = Элементы.ДоговорыУВХД.ТекущиеДанные;
		ТекущиеДанные.Договор1С = ПолучитьСсылкуЗначенияСвойства(ВыбранныйДоговор);
		ТекущиеДанные.ПредставлениеДоговор1С = Строка(ВыбранныйДоговор);
		
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьВыбранныеДоговоры1С(ТекущийДоговор1С = Неопределено)
	
	ВыбранныеДоговоры1С = Новый Массив();
	Для каждого СтрокаДоговорыУВХД Из Объект.ДоговорыУВХД Цикл
		
		Если СтрокаДоговорыУВХД.Договор1С = ТекущийДоговор1С Тогда
			Продолжить;	
		КонецЕсли;
		
		Договор1С = Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойстваОсновнойКонфигурации(СтрокаДоговорыУВХД, "Договор1С");
		Если Не Договор1С = Неопределено Тогда
			ВыбранныеДоговоры1С.Добавить(Договор1С);				
		КонецЕсли;	
		
	КонецЦикла;
	
	Возврат ВыбранныеДоговоры1С;
	
КонецФункции

&НаСервере
Функция ПолучитьВыбранныеДоговорыУВХД(ТекущийДоговорУВХД = Неопределено)
	
	ВыбранныеДоговорыУВХД = Новый Массив();
	Для каждого СтрокаДоговорыУВХД Из Объект.ДоговорыУВХД Цикл
		
		ВыбранныйДоговорУВХД = СтрокаДоговорыУВХД.ДоговорУВХД;
		
		Если ТекущийДоговорУВХД = ВыбранныйДоговорУВХД Тогда
			Продолжить;			
		КонецЕсли;				
		
		Если ЗначениеЗаполнено(ВыбранныйДоговорУВХД) Тогда
			ВыбранныеДоговорыУВХД.Добавить(ВыбранныйДоговорУВХД);				
		КонецЕсли;	
		
	КонецЦикла;

	Возврат ВыбранныеДоговорыУВХД;
	
КонецФункции

#КонецОбласти

#Область Общие

&НаКлиенте
Процедура ОбновитьОтображениеЭлементов()
	
	Элементы.ГруппаНастройкиУВХД.Видимость = ККСНГ_ОбщегоНазначенияВызовСервераПовтИсп.ИспользуетсяБизнесПроцессУВХД() 
											 И ККСНГ_РаботаСКонтрагентамиВызовСервера.ЭтоКонтрагентСбер(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуЗначенияСвойства(СсылкаНаОбъект)
	Возврат Справочники.ККСНГ_ЗначенияСвойствОбъектов.ПолучитьСсылкуЗначенияСвойства(СсылкаНаОбъект);
КонецФункции

&НаКлиенте
Процедура ДоговорыУВХДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Не Отказ И Копирование Тогда
		Отказ = Истина;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорыУВХДДоговор1СНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПриИзмененииКонтрагента(ВыбранноеЗначение, ДополнительныеПараметры = Неопределено) Экспорт

	Если ВыбранноеЗначение = КодВозвратаДиалога.Отмена И НЕ ДополнительныеПараметры = Неопределено Тогда
		Объект.Контрагент = ДополнительныеПараметры.КонтрагентДоИзменения;
		Объект.Владелец = ДополнительныеПараметры.ОрганизацияДоИзменения;
		ЭтаФорма.Модифицированность = ДополнительныеПараметры.ЗначенияМодифицированности;
	Иначе
		ПриИзмененииКонтрагентаОрганизации();	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросПриИзмененииКонтрагента(ЗначенияМодифицированности)

	Если Объект.ДоговорыУВХД.Количество() = 0 Тогда
	
		ОбработкаВыбораПриИзмененииКонтрагента(КодВозвратаДиалога.ОК);
		Возврат;
	
	КонецЕсли;
	
	Режим = РежимДиалогаВопрос.ОКОтмена;
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КонтрагентДоИзменения", Объект.Контрагент);
	ДополнительныеПараметры.Вставить("ОрганизацияДоИзменения", Объект.Владелец);
	ДополнительныеПараметры.Вставить("ЗначенияМодифицированности", ЗначенияМодифицированности);
	Оповещение = Новый ОписаниеОповещения("ОбработкаВыбораПриИзмененииКонтрагента", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = "При изменении контрагента таблица сопоставления договоров будет очищена. Изменить контрагента?";

	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим, 0, КодВозвратаДиалога.ОК);		

КонецПроцедуры

#КонецОбласти

#КонецОбласти
